Revit 2016 API
UIView Members
The UIView type exposes the following members.
Methods
Name | Description
Close
Closes the view.
Dispose
Releases all resources used by the UIView
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetWindowRectangle
Gets the rectangle containing the coordinates of the view's drawing area.
GetZoomCorners
Gets the corners of the view's rectangle.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Zoom
Zoom the view.
ZoomAndCenterRectangle
Zoom and center the view to a specified rectangle.
ZoomSheetSize
Zoom to the sheet size.
ZoomToFit
Zoom the view to fit its contents.
Properties
Name | Description
ViewId
The id of the View associated with a UIView.
See Also
UIView Class
Autodesk.Revit.UI Namespace